eisup_2019_docmng_integration/src/Documents/абс_КомплектацияОСМеждународный/абс_КомплектацияОСМеждународный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_КомплектацияОСМеждународный</name>
  <basedOn>Catalog.ОсновныеСредства</basedOn>
  <registerRecords>InformationRegister.ОсновныеСредстваМеждународныйУчет</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавноеОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеПринятияКУчету</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеВводВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеСписание</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВБухгалтерскомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВНалоговомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВУправленческомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектация</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/ОсновныеСредстваМеждународныйУчет/ОсновныеСредстваМеждународныйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОсновныеСредстваМеждународныйУчет</name>
  <comment>(Упр) Сведения об объектах ОС  для целей международного учета</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <comment>Организация, на балансе которой учитывется объект ОС в международном учете</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПринятияКУчету</name>
    <comment>Дата принятия объекта к международному учету</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестонахождениеОбъекта</name>
    <comment>Подразделение организации, в котором находится объект ОС</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ВидыСостоянийОС</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчета</name>
    <comment>Счет учета в плане счетов Международный</comment>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <comment>Срок полезного использования в месяцах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизацию</name>
    <comment>Булево - начиляется амортизация или нет</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МетодНачисленияАмортизации</name>
    <comment>Метод начисления амортизации по международному учету</comment>
    <type>
      <types>EnumRef.МетодыНачисленияАмортизацииОСМеждународный</types>
    </type>
  </resources>
  <resources>
    <name>СчетНачисленияАмортизации</name>
    <comment>Счет, на котором накапливается начисленная амортизация</comment>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимость</name>
    <comment>Первоначальная (историческая) стоимость объекта</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СправедливаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимость</name>
    <comment>Стоимость, которая должна остаться после истечения срока полезного использования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <comment>Счет учета, в дебет которого относятся амортизационные отчисления</comment>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>Субконто1</name>
    <comment>Субконто первого уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто2</name>
    <comment>Субконто второго уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто3</name>
    <comment>Субконто третьего уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>ПредполагаемыйОбъемПродукции</name>
    <comment>Используется при амортизации пропорционально объему продукции</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНачисленнойАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УбытокОтОбесценения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетСниженияСтоимости</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/AccountingRegisters/Международный/Международный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Международный</name>
  <comment>(Упр)</comment>
  <chartOfAccounts>ChartOfAccounts.Международный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервичныйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

eisup_2019_docmng_integration/src/Documents/абс_КомплектацияОСМеждународный/ObjectModule.bsl
Перем мУдалятьДвижения;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОтражатьВБухгалтерскомУчете Тогда
		ОтражатьВБухгалтерскомУчете = Истина;
	КонецЕсли;
	Если НЕ ОтражатьВНалоговомУчете Тогда
		ОтражатьВНалоговомУчете = Истина;
	КонецЕсли;
	Если НЕ ОтражатьВУправленческомУчете Тогда
		ОтражатьВУправленческомУчете = Истина;
	КонецЕсли;

	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью()

Процедура ОбработкаПроведения(Отказ,РежимПроведения)

	Если мУдалятьДвижения Тогда
		ttk_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;

	Заголовок = ttk_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ТабОС = Комплектация.ВыгрузитьКолонку("ОсновноеСредство");
	
	// Проверим правильность заполнения документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	//ПроверитьЗаполнениеТабЧасти(РежимПроведения, ТабОС, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(ТабОС, СтруктураШапкиДокумента, Заголовок, Отказ);
	КонецЕсли;

КонецПроцедуры // ОбработкаПроведения()

// Процедура проверяет корректность заполнения реквизитов шапки документа
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	СтруктураРеквизитовШапки = Новый Структура;
	СтруктураРеквизитовШапки.Вставить("Организация");
	СтруктураРеквизитовШапки.Вставить("ОсновноеСредство");
	СтруктураРеквизитовШапки.Вставить("СобытиеПринятияКУчету");
	СтруктураРеквизитовШапки.Вставить("СобытиеВводВЭксплуатацию");
	СтруктураРеквизитовШапки.Вставить("СобытиеСписание");
	
	Если НЕ ЗначениеЗаполнено(ГлавноеОсновноеСредство) Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не указано главное основное средство!", Отказ, Заголовок);
	КонецЕсли;
					
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураРеквизитовШапки, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Процедура формирования движений по регистрам.
//
Процедура ДвиженияПоРегистрам(ТабОС, СтруктураШапкиДокумента, Заголовок, Отказ)
	
	ТабАмортизации = Новый ТаблицаЗначений;
	ТабАмортизации.Колонки.Добавить("ОсновноеСредство",       Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ТабАмортизации.Колонки.Добавить("АмортизацияЗаМесяцБУ",   Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла( 15, 2)));
	ТабАмортизации.Колонки.Добавить("АмортизацияЗаМесяцНУ",   Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла( 15, 2)));
	
	//ДвижениеПоРегиструОСМеждународныйУчет( ТабОС, СтруктураШапкиДокумента);
	ФормированиеПроводокМеждународный( ТабОС, СтруктураШапкиДокумента);
	
КонецПроцедуры // ДвиженияПоРегистрам()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА ПО РЕГИСТРАМ

Процедура ДвижениеПоРегиструОСМеждународныйУчет(ТабОС,ТабСтоимостьОС,ТабАмортизация)
	
	НаборДвижений = РегистрыСведений.ОсновныеСредстваМеждународныйУчет.СоздатьНаборЗаписей();
	НаборДвижений.Отбор.Регистратор.Установить(Ссылка);
	Движение = НаборДвижений.Добавить();
	Движение.Регистратор = Ссылка;
	Движение.ОсновноеСредство = ОсновноеСредство;
	Движение.Период      = Дата;
	Движение.Организация = Организация;
	Движение.ДатаПринятияКУчету = Дата;
	Движение.Состояние   = Перечисления.ВидыСостоянийОС.ВведеноВЭксплуатацию;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.МОЛ,
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.СчетУчета,
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.СрокПолезногоИспользования,
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.НачислятьАмортизацию,
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.СчетНачисленияАмортизации,
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.СчетЗатрат,
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.Субконто1,
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.Субконто2,
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.Субконто3,
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.ПредполагаемыйОбъемПродукции,
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.СуммаНачисленнойАмортизации,
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.УбытокОтОбесценения,
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.КоэффициентУскорения,
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.СчетСниженияСтоимости,
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.МетодНачисленияАмортизации,
	|	ОсновныеСредстваМеждународныйУчетСрезПоследних.МестонахождениеОбъекта
	|ИЗ
	|	РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(
	|			&НаДату,
	|			ОсновноеСредство = &ОсновноеСредство
	|				И Организация = &Организация) КАК ОсновныеСредстваМеждународныйУчетСрезПоследних";
	
	Запрос.УстановитьПараметр("НаДату", Дата);
	Запрос.УстановитьПараметр("ОсновноеСредство", ГлавноеОсновноеСредство);
	Запрос.УстановитьПараметр("Организация", Организация);

	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение.МОЛ                             = ВыборкаДетальныеЗаписи.МОЛ;
		Движение.СчетУчета                       = ВыборкаДетальныеЗаписи.СчетУчета;
		Движение.СрокПолезногоИспользования      = ВыборкаДетальныеЗаписи.СрокПолезногоИспользования;
		Движение.НачислятьАмортизацию            = ВыборкаДетальныеЗаписи.НачислятьАмортизацию;
		Движение.МетодНачисленияАмортизации      = ВыборкаДетальныеЗаписи.МетодНачисленияАмортизации;
		Движение.СчетНачисленияАмортизации       = ВыборкаДетальныеЗаписи.СчетНачисленияАмортизации;
		Движение.СчетЗатрат                      = ВыборкаДетальныеЗаписи.СчетЗатрат;
		Движение.Субконто1                       = ВыборкаДетальныеЗаписи.Субконто1;
		Движение.Субконто2                       = ВыборкаДетальныеЗаписи.Субконто2;
		Движение.Субконто3                       = ВыборкаДетальныеЗаписи.Субконто3;
		Движение.ПредполагаемыйОбъемПродукции    = ВыборкаДетальныеЗаписи.ПредполагаемыйОбъемПродукции; 
		Движение.УбытокОтОбесценения             = ВыборкаДетальныеЗаписи.УбытокОтОбесценения;
		Движение.КоэффициентУскорения            = ВыборкаДетальныеЗаписи.КоэффициентУскорения;
		Движение.СчетСниженияСтоимости           = ВыборкаДетальныеЗаписи.СчетСниженияСтоимости;
		Движение.МестонахождениеОбъекта			 = ВыборкаДетальныеЗаписи.МестонахождениеОбъекта;
	КонецЦикла;


	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ОсновныеСредстваМеждународныйУчетСрезПоследних.ПервоначальнаяСтоимость) КАК ПервоначальнаяСтоимость,
	|	СУММА(ОсновныеСредстваМеждународныйУчетСрезПоследних.СуммаНачисленнойАмортизации) КАК СуммаНачисленнойАмортизации,
	|	СУММА(ОсновныеСредстваМеждународныйУчетСрезПоследних.СправедливаяСтоимость) КАК СправедливаяСтоимость
	|ИЗ
	|	РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(
	|			&НаДату,
	|			ОсновноеСредство В (&СписокОС)
	|				И Организация = &Организация) КАК ОсновныеСредстваМеждународныйУчетСрезПоследних";
	
	Запрос.УстановитьПараметр("НаДату", Дата);
	Запрос.УстановитьПараметр("СписокОС", ТабОС);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение.ПервоначальнаяСтоимость         = ВыборкаДетальныеЗаписи.ПервоначальнаяСтоимость; 
		Движение.СправедливаяСтоимость           = ВыборкаДетальныеЗаписи.СправедливаяСтоимость;
		Движение.СуммаНачисленнойАмортизации     = ВыборкаДетальныеЗаписи.СуммаНачисленнойАмортизации;
	КонецЦикла;

	НаборДвижений.Записать();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

// Процедура формирование проводок.
//
Процедура ФормированиеПроводокМеждународный( ТабОС, СтруктураШапкиДокумента)
	
	Операция = Движения.Международный;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МеждународныйОстатки.Субконто1,
	|	МеждународныйОстатки.СуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.Международный.Остатки(
	|			&Период,
	|			Счет = &Счет,
	|			,
	|			Организация = &Организация
	|				И Субконто1 В (&ОсновныеСредства)) КАК МеждународныйОстатки";
	Запрос.УстановитьПараметр("Период", 			Новый Граница(Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Счет", 				ПланыСчетов.Международный.ОСвОрганизации);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("ОсновныеСредства", 	ТабОС);
	ОстаткиПоОС = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаОС Из ОстаткиПоОС Цикл
		
		Проводка = Операция.Добавить();
		Проводка.Период      = Дата;
		Проводка.Организация = Организация;
		Проводка.Содержание  = "Комплектация ОС";
		
		Проводка.Сумма       = СтрокаОС.СуммаОстаток;
		
		Проводка.СчетДт = ПланыСчетов.Международный.ОСвОрганизации;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОсновныеСредства", ОсновноеСредство);
		
		Проводка.СчетКт = ПланыСчетов.Международный.ОСвОрганизации;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ОсновныеСредства", СтрокаОС.Субконто1);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МеждународныйОстатки.Субконто1,
	|	-МеждународныйОстатки.СуммаОстаток КАК Амортизация
	|ИЗ
	|	РегистрБухгалтерии.Международный.Остатки(
	|			&Период,
	|			Счет = &Счет,
	|			,
	|			Организация = &Организация
	|				И Субконто1 В (&ОсновныеСредства)) КАК МеждународныйОстатки";
	Запрос.УстановитьПараметр("Период", 			Новый Граница(Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Счет", 				ПланыСчетов.Международный.АмортизацияОС_01);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("ОсновныеСредства", 	ТабОС);
	ОстаткиПоОСАм = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаОС Из ОстаткиПоОСАм Цикл
		
		Проводка = Операция.Добавить();
		Проводка.Период      = Дата;
		Проводка.Организация = Организация;
		Проводка.Содержание  = "Комплектация ОС";
		
		Проводка.Сумма       = СтрокаОС.Амортизация;
		
		Проводка.СчетДт = ПланыСчетов.Международный.АмортизацияОС_01;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОсновныеСредства", СтрокаОС.Субконто1);
		
		Проводка.СчетКт = ПланыСчетов.Международный.АмортизацияОС_01;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ОсновныеСредства", ОсновноеСредство);
		
	КонецЦикла;
	
	ДвижениеПоРегиструОСМеждународныйУчет(ТабОС,ОстаткиПоОС,ОстаткиПоОСАм);
	
КонецПроцедуры // ФормированиеПроводокБух

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если мУдалятьДвижения Тогда
		ttk_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ГлавноеОсновноеСредство = Неопределено;
КонецПроцедуры
